{
"About": {
  "Name": "David Lee",
  "Currently": "Electrical Engineering Student with a background in Biology",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hello, I am David Lee. I am a passionate electrical engineering student with a keen interest in biotech and biomed engineering. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of electrical engineering and biology.<br><br>I enjoy tackling challenging technical projects, and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to community building as a Resident Advisor and learning new hobbies. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "EMail": "leed35@spu.edu",
  "Portfolio": "david2003lee.github.io",
  "LinkedIn": "www.linkedin.com/in/davidlee2003",
  "GitHub": "https://www.github.com"
},
"Experience": {
  "ExperienceText": "I am an electrical engineer with hands-on experience designing embedded systems, power electronics, and human–machine interfaces. Much of my work centers on integrating hardware, firmware, and signal conditioning for real-world applications. I have developed a multi-servo prosthetic hand controlled through EMG muscle signals, including custom filtering, ADC mapping, and motion-classification logic. Alongside this, I’ve designed several PCBs such as a multi-voltage power stage, a buck converter, a boost converter, and a fully isolated DC-AC flyback converter. These projects strengthened my understanding of power systems, switching topologies, and PCB layout for both efficiency and manufacturability. Currently, I am building a mobile solar power generator intended for disaster-relief and mission-critical scenarios. This project combines solar power harvesting, MPPT control, battery management, and ruggedized mechanical design. I’m driven by creating systems that are both technically elegant and practically useful—bridging electronics, biomechanics, and sustainable technologies.",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering",
  "Graduation": "June 2026",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Seattle Pacific University",
  "Role": "Anatomy and Physiology Teaching & Lab Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", " Assembly", " MultiSim", " MatLab"," RStudio"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume": "student-resume.pdf"  
},
"Project1": {
    "Title": "Interesting Project 1",
    "Desc": "This is a description of Project One.<br><br>It has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Interesting Project 2",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "Interesting Project 3",
    "Desc": "This is a description of Project Three.<br><br>It does not have a GitHub repo or any additional screenshots.",
    "GitHubRepo": "",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
