 {
"About": {
  "Name": "David Lee",
  "Currently": "Electrical Engineering Student with a Background in Biology",
  "Headshot": "headshotss.png",
  "Thumbnail": "Screenshot 2025-12-10 170235.png",
  "AboutText": "Hello, I am David Lee. I am a passionate electrical engineering student with a keen interest in biotech and biomed engineering. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of electrical engineering and biology.<br><br>I enjoy tackling challenging technical projects, and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to community building as a Resident Advisor and learning new hobbies. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "EMail": "leed35@spu.edu",
  "Portfolio": "david2003lee.github.io",
  "LinkedIn": "www.linkedin.com/in/davidlee2003",
  "GitHub": "https://www.github.com"
},
"Experience": {
  "ExperienceText": "I am an electrical engineer with practical experience in embedded systems power-electronics and human–machine interfaces. I built an EMG-controlled prosthetic hand with custom signal filtering ADC mapping and motion logic. I designed PCBs that include a multi voltage power stage a buck converter a boost converter and an isolated DC AC flyback converter which strengthened my skills in power systems and PCB layout. I am currently developing a mobile solar power generator for disaster relief and mission critical use with features such as MPPT control battery management and rugged mechanical design. I focus on creating systems that are technically strong and highly useful in real world applications across electronics biomechanics and sustainable technology.",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering",
  "Graduation": "June 2026",
  "EducationText": "I studied electrical engineering with a focus on circuits, powersystems, microcontrollers signal processing, and bio-inspired design. My work in these areas helped me build strong skills in analysis, design, and hands-on engineering practice.",
  "Employment": "Seattle Pacific University",
  "Role": "Resident Advisor and Anatomy and Physiology Teaching & Lab Assistant",
  "EmploymentText": "In my role as a Resident Advisor and as an Anatomy and Physiology Teaching and Lab Assistant, I support both student learning and student community life. As a Resident Advisor, I mentor residents, guide conflict resolution, and help create a safe and supportive living environment. As a Teaching and Lab Assistant, I prepare weekly labs, assist students during experiments, and reinforce key concepts in human biology. These roles strengthened my leadership communication and problem-solving skills, and they taught me how to support others with patience, clarity, and professionalism.",
  "Skills": ["C++", " Assembly", " MultiSim", " MatLab"," RStudio", "Atium"],
  "SkillsText": "My skills include embedded programming circuit-design, PCB layout, and signal analysis. I enjoy solving engineering problems and creating systems that are clear, functional, and dependable.",
  "Resume": "Lee David Resume 2025 (1).pdf"  
},
"Project1": {
    "Title": "DC-DC Converter & DC-AC Inverter",
    "Desc": "Designed and printed PCB that had buck and boost converter along with the DCAC Flyback inverter design",
    "GitHubRepo": "",
    "MainImage": "ConvertInvertPCB3D",
    "DetailImages": []
  },
  "Project2": {
    "Title": "EMG Signal Reading Prosthetic Arm",
    "Desc": "Developed a prosthetic that read muscle activities and flexed the fingers accordingly",
    "GitHubRepo": "",
    "MainImage": "thumbnail_IMG_9769.jpg",
    "DetailImages": []
  },
  "Project3": {
    "Title": "Simulation of Solar Power Generator",
    "Desc": "Simulation model that displays the mobile solar power generator output data depending on various input variables.",
    "GitHubRepo": "",
    "MainImage": "PIDControl.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
